
         //************************************************** 
         // Prototipo Obtener registro del BNKMSG          *
         //**************************************************

         dcl-pr GET_BNKMSG;
                In_Code     int(10);
                Ou_Message  char(200); 
         end-pr;
         