
        //*******************************************************
        // Prototipo para obtener la descripcion de un parametro*
        //*******************************************************

        dcl-pr Get_pardsc   Int(10);
            In_table        char(2);
            In_code         char(4);
            Ou_descripcion  char(100);
        end-pr;
        

