
        //*******************************************************
        // Prototipo para obtener un Secuencial                 *
        //*******************************************************

        dcl-pr GET_SECNUM   Int(10);
            In_TypeSec      char(2) value;
            Ou_Secue        zoned(9);
        end-pr;