         //************************************************** 
         // Prototipo Grabar cliente en BKNCLI              *
         //**************************************************

         dcl-pr SAV_CLIENT int(10);
                 In_DatCli likeds(DS_InpRegCli);
                 Ou_code   zoned(9);
         end-pr;
         
