
         //************************************************** 
         // Prototipo para actualizar cliente en BKNCLI     *
         //**************************************************

         dcl-pr UPD_CLIENT int(10);
                 In_code   zoned(9);
                 In_DatCli likeds(DS_InpActCli);
         end-pr;
         
